backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 10
      - 60
      dtype: float32
      name: simple_rnn_input
      ragged: false
      sparse: false
  - class_name: SimpleRNN
    config:
      activation: tanh
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 10
      - 60
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: simple_rnn
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      units: 128
      unroll: true
      use_bias: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 60
      use_bias: true
  - class_name: Activation
    config:
      activation: softmax
      dtype: float32
      name: activation
      trainable: true
  name: sequential
keras_version: 2.4.0
